[
  {
    "id": "1",
    "title": "The Art of Palace Living: Rajasthan's Hidden Gems",
    "excerpt": "Discover heritage hotels where Maharajas once held court, now welcoming discerning travelers to experience royal life. From Udaipur's lake palaces to Jaipur's restored havelis.",
    "content": "<p>Rajasthan, the Land of Kings, holds some of India's most extraordinary accommodation experiences. Beyond the well-known palace hotels of Udaipur and Jaipur lie hidden gems that offer authentic glimpses into royal Indian life.</p>\n\n<h2>The Legacy of Royal Hospitality</h2>\n<p>When India gained independence in 1947, many royal families found themselves with magnificent properties but dwindling resources to maintain them. The solution? Opening their doors to discerning travelers who wished to experience the grandeur of Indian royalty firsthand.</p>\n\n<p>Today, these heritage properties range from intimate havelis (traditional mansions) with just a handful of rooms to sprawling palace complexes that rival the world's finest hotels. What sets them apart is not just their architecture, but the personal touch that comes from staying with families whose ancestors once ruled kingdoms.</p>\n\n<h2>Hidden Gems Worth Discovering</h2>\n<p>While the Taj Lake Palace and Umaid Bhawan grace every luxury travel list, Rajasthan hides dozens of lesser-known treasures. In the small town of Rohet, the Rohet Garh offers horseback safaris through the surrounding countryside. The Chanoud Garh, a 300-year-old property, provides cooking classes where you learn family recipes passed down through generations.</p>",
    "image": "/blog/blog-1.jpg",
    "category": "Luxury Stays",
    "author": "Rajesh Sharma",
    "readTime": "8 min read",
    "date": "January 15, 2025",
    "featured": true,
    "tags": ["Rajasthan", "Heritage Hotels", "Luxury", "Culture"]
  },
  {
    "id": "2",
    "title": "A Culinary Journey Through Northern India",
    "excerpt": "From street food to Michelin-worthy experiences, explore the diverse flavors that define India's culinary heritage. Discover the stories behind each dish.",
    "content": "<p>Northern India's cuisine tells the story of Mughal emperors, ancient trade routes, and regional traditions that have evolved over millennia. From the fiery streets of Old Delhi to the refined dining rooms of heritage hotels, a culinary journey through this region is a feast for all senses.</p>\n\n<h2>The Street Food Trail</h2>\n<p>No culinary exploration of North India is complete without diving into its street food culture. In Delhi's Chandni Chowk, vendors have been perfecting their craft for generations. Here you'll find the legendary Paranthe Wali Gali, where stuffed parathas are fried in ghee that's been used and replenished for over a century.</p>",
    "image": "/blog/blog-2.jpg",
    "category": "Food & Culture",
    "author": "Sarah Mitchell",
    "readTime": "6 min read",
    "date": "January 10, 2025",
    "featured": true,
    "tags": ["Food", "Culture", "Delhi", "Street Food"]
  },
  {
    "id": "3",
    "title": "Wildlife Encounters: India's Best Safari Experiences",
    "excerpt": "Track Bengal tigers in their natural habitat and discover the untamed beauty of India's national parks. Tips for ethical wildlife tourism.",
    "content": "<p>India is home to over 70% of the world's wild tiger population, making it the ultimate destination for those seeking to witness these magnificent creatures in their natural habitat. But India's wildlife extends far beyond tigers—from one-horned rhinos to snow leopards, the diversity is extraordinary.</p>\n\n<h2>Tiger Country</h2>\n<p>The central Indian parks of Ranthambore, Bandhavgarh, and Kanha offer some of the best tiger sighting opportunities in the world.</p>",
    "image": "/blog/blog-3.jpg",
    "category": "Adventure",
    "author": "Tenzin Dorji",
    "readTime": "7 min read",
    "date": "January 5, 2025",
    "featured": true,
    "tags": ["Wildlife", "Safari", "Tigers", "Nature"]
  },
  {
    "id": "4",
    "title": "Trekking to Everest Base Camp: A Complete Guide",
    "excerpt": "Everything you need to know about the world's most iconic trek. From preparation to packing, altitude to acclimatization.",
    "content": "<p>The journey to Everest Base Camp is a bucket-list adventure that combines stunning Himalayan scenery with Sherpa culture and the thrill of standing at the foot of the world's highest peak.</p>",
    "image": "/destinations/nepal.jpg",
    "category": "Adventure",
    "author": "Tenzin Dorji",
    "readTime": "12 min read",
    "date": "December 28, 2024",
    "featured": false,
    "tags": ["Nepal", "Trekking", "Everest", "Adventure"]
  },
  {
    "id": "5",
    "title": "Bhutan's Gross National Happiness: Travel Lessons",
    "excerpt": "What the world's happiest kingdom can teach us about mindful travel and meaningful experiences beyond material gains.",
    "content": "<p>In Bhutan, happiness is a national priority. This Buddhist kingdom offers travelers a chance to step back and reconsider what truly matters.</p>",
    "image": "/destinations/bhutan.jpg",
    "category": "Culture",
    "author": "Tenzin Dorji",
    "readTime": "9 min read",
    "date": "December 20, 2024",
    "featured": false,
    "tags": ["Bhutan", "Culture", "Mindfulness", "Travel"]
  },
  {
    "id": "6",
    "title": "Sunrise at the Taj Mahal: A Photographer's Guide",
    "excerpt": "Capture the world's most romantic monument in perfect light. Camera settings, best angles, and insider tips for stunning shots.",
    "content": "<p>As dawn breaks over Agra, the Taj Mahal transforms from a dark silhouette to a glowing masterpiece of Mughal architecture.</p>",
    "image": "/destinations/taj-mahal.jpg",
    "category": "Photography",
    "author": "Sarah Mitchell",
    "readTime": "6 min read",
    "date": "December 15, 2024",
    "featured": false,
    "tags": ["Photography", "Taj Mahal", "Agra", "Tips"]
  },
  {
    "id": "7",
    "title": "Kerala's Ayurvedic Retreats: Healing Body and Soul",
    "excerpt": "An insider's guide to authentic Ayurvedic experiences in God's Own Country. What to expect and how to choose the right retreat.",
    "content": "<p>Ayurveda, the 5,000-year-old science of life, finds its purest expression in Kerala's tranquil backwaters and lush hills.</p>",
    "image": "/destinations/kerala.jpg",
    "category": "Wellness",
    "author": "Rajesh Sharma",
    "readTime": "8 min read",
    "date": "December 10, 2024",
    "featured": false,
    "tags": ["Kerala", "Ayurveda", "Wellness", "Spa"]
  },
  {
    "id": "8",
    "title": "The Sacred Rituals of Varanasi",
    "excerpt": "Understanding the spiritual significance of India's holiest city. A respectful guide to witnessing ancient ceremonies on the Ganges.",
    "content": "<p>Varanasi, also known as Kashi or Benares, has been a center of spiritual life for over 3,000 years.</p>",
    "image": "/destinations/varanasi.jpg",
    "category": "Culture",
    "author": "Rajesh Sharma",
    "readTime": "10 min read",
    "date": "December 5, 2024",
    "featured": false,
    "tags": ["Varanasi", "Spirituality", "Culture", "Ganges"]
  }
]
